docker/deployment-init/files/update-cellery-hub-application.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://org.apache.axis2/xsd" xmlns:xsd1="http://model.common.application.identity.carbon.wso2.org/xsd">
    <soap:Header/>
    <soap:Body>
        <xsd:updateApplication>
            <!--Optional:-->
            <xsd:serviceProvider>
                <xsd:applicationID>3</xsd:applicationID>
                <xsd:applicationName>CelleryWebPortal</xsd:applicationName>
                <xsd:claimConfig>
                    <xsd:alwaysSendMappedLocalSubjectId>true</xsd:alwaysSendMappedLocalSubjectId>
                    <xsd:claimMappings>
                        <xsd:localClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/organization</xsd:claimUri>
                        </xsd:localClaim>
                        <xsd:mandatory>false</xsd:mandatory>
                        <xsd:remoteClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/organization</xsd:claimUri>
                        </xsd:remoteClaim>
                        <xsd:requested>true</xsd:requested>
                    </xsd:claimMappings>
                    <xsd:claimMappings>
                        <xsd:localClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/userid</xsd:claimUri>
                        </xsd:localClaim>
                        <xsd:mandatory>false</xsd:mandatory>
                        <xsd:remoteClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/userid</xsd:claimUri>
                        </xsd:remoteClaim>
                        <xsd:requested>true</xsd:requested>
                    </xsd:claimMappings>
                    <xsd:claimMappings>
                        <xsd:localClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/fullname</xsd:claimUri>
                        </xsd:localClaim>
                        <xsd:mandatory>false</xsd:mandatory>
                        <xsd:remoteClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/fullname</xsd:claimUri>
                        </xsd:remoteClaim>
                        <xsd:requested>true</xsd:requested>
                    </xsd:claimMappings>
                    <xsd:claimMappings>
                        <xsd:localClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/social/idp-common-attribute</xsd:claimUri>
                        </xsd:localClaim>
                        <xsd:mandatory>false</xsd:mandatory>
                        <xsd:remoteClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/social/idp-common-attribute</xsd:claimUri>
                        </xsd:remoteClaim>
                        <xsd:requested>true</xsd:requested>
                    </xsd:claimMappings>
                    <xsd:claimMappings>
                        <xsd:localClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/github-pic-url</xsd:claimUri>
                        </xsd:localClaim>
                        <xsd:mandatory>false</xsd:mandatory>
                        <xsd:remoteClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/github-pic-url</xsd:claimUri>
                        </xsd:remoteClaim>
                        <xsd:requested>true</xsd:requested>
                    </xsd:claimMappings>
                    <xsd:claimMappings>
                        <xsd:localClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/google-pic-url</xsd:claimUri>
                        </xsd:localClaim>
                        <xsd:mandatory>false</xsd:mandatory>
                        <xsd:remoteClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/google-pic-url</xsd:claimUri>
                        </xsd:remoteClaim>
                        <xsd:requested>true</xsd:requested>
                    </xsd:claimMappings>
                    <xsd:claimMappings>
                        <xsd:localClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/region</xsd:claimUri>
                        </xsd:localClaim>
                        <xsd:mandatory>false</xsd:mandatory>
                        <xsd:remoteClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/region</xsd:claimUri>
                        </xsd:remoteClaim>
                        <xsd:requested>true</xsd:requested>
                    </xsd:claimMappings>
                    <xsd:claimMappings>
                        <xsd:localClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/url</xsd:claimUri>
                        </xsd:localClaim>
                        <xsd:mandatory>false</xsd:mandatory>
                        <xsd:remoteClaim>
                            <xsd:claimId>0</xsd:claimId>
                            <xsd:claimUri>http://wso2.org/claims/url</xsd:claimUri>
                        </xsd:remoteClaim>
                        <xsd:requested>true</xsd:requested>
                    </xsd:claimMappings>
                    <xsd:localClaimDialect>true</xsd:localClaimDialect>
                    <xsd:roleClaimURI/>
                </xsd:claimConfig>
                <xsd1:inboundAuthenticationConfig>
                    <xsd1:inboundAuthenticationRequestConfigs>
                        <xsd1:inboundAuthKey>celleryhubapplication</xsd1:inboundAuthKey>
                        <xsd1:inboundAuthType>oauth2</xsd1:inboundAuthType>
                        <xsd1:properties>
                            <xsd1:confidential>false</xsd1:confidential>
                            <xsd1:name>oauthConsumerSecret</xsd1:name>
                            <xsd1:required>false</xsd1:required>
                            <xsd1:type xsd:nil="true"/>
                            <xsd1:value>celleryhubapplication</xsd1:value>
                        </xsd1:properties>
                    </xsd1:inboundAuthenticationRequestConfigs>
                </xsd1:inboundAuthenticationConfig>
                <xsd1:localAndOutBoundAuthenticationConfig>
                    <xsd1:alwaysSendBackAuthenticatedListOfIdPs>true</xsd1:alwaysSendBackAuthenticatedListOfIdPs>
                    <xsd1:authenticationScriptConfig>
                        <xsd1:content>function onLoginRequest(context) {
                            executeStep(1);
                            }</xsd1:content>
                        <xsd1:enabled>false</xsd1:enabled>
                        <xsd1:language>application/javascript</xsd1:language>
                    </xsd1:authenticationScriptConfig>
                    <xsd1:authenticationSteps>
                        <xsd1:attributeStep>true</xsd1:attributeStep>
                        <xsd1:federatedIdentityProviders>
                            <xsd1:defaultAuthenticatorConfig>
                                <xsd1:displayName>google</xsd1:displayName>
                                <xsd1:enabled>false</xsd1:enabled>
                                <xsd1:name>GoogleOIDCAuthenticator</xsd1:name>
                                <xsd1:valid>true</xsd1:valid>
                            </xsd1:defaultAuthenticatorConfig>
                            <xsd1:displayName/>
                            <xsd1:enable>false</xsd1:enable>
                            <xsd1:federatedAuthenticatorConfigs>
                                <xsd1:displayName>google</xsd1:displayName>
                                <xsd1:enabled>false</xsd1:enabled>
                                <xsd1:name>GoogleOIDCAuthenticator</xsd1:name>
                                <xsd1:valid>true</xsd1:valid>
                            </xsd1:federatedAuthenticatorConfigs>
                            <xsd1:federationHub>true</xsd1:federationHub>
                            <xsd1:homeRealmId/>
                            <xsd1:id/>
                            <xsd1:identityProviderName>google</xsd1:identityProviderName>
                            <xsd1:primary>false</xsd1:primary>
                        </xsd1:federatedIdentityProviders>
                        <xsd1:federatedIdentityProviders>
                            <xsd1:defaultAuthenticatorConfig>
                                <xsd1:displayName>github</xsd1:displayName>
                                <xsd1:enabled>false</xsd1:enabled>
                                <xsd1:name>CelleryGithubAuthenticator</xsd1:name>
                                <xsd1:valid>true</xsd1:valid>
                            </xsd1:defaultAuthenticatorConfig>
                            <xsd1:enable>false</xsd1:enable>
                            <xsd1:federatedAuthenticatorConfigs>
                                <xsd1:displayName>github</xsd1:displayName>
                                <xsd1:enabled>false</xsd1:enabled>
                                <xsd1:name>CelleryGithubAuthenticator</xsd1:name>
                                <xsd1:valid>true</xsd1:valid>
                            </xsd1:federatedAuthenticatorConfigs>
                            <xsd1:federationHub>true</xsd1:federationHub>
                            <xsd1:identityProviderName>github</xsd1:identityProviderName>
                            <xsd1:primary>false</xsd1:primary>
                        </xsd1:federatedIdentityProviders>
                        <xsd1:stepOrder>1</xsd1:stepOrder>
                        <xsd1:subjectStep>true</xsd1:subjectStep>
                    </xsd1:authenticationSteps>
                    <xsd1:authenticationType>flow</xsd1:authenticationType>
                    <xsd1:enableAuthorization>false</xsd1:enableAuthorization>
                    <xsd1:useTenantDomainInLocalSubjectIdentifier>false</xsd1:useTenantDomainInLocalSubjectIdentifier>
                    <xsd1:useUserstoreDomainInLocalSubjectIdentifier>false</xsd1:useUserstoreDomainInLocalSubjectIdentifier>
                    <xsd1:useUserstoreDomainInRoles>true</xsd1:useUserstoreDomainInRoles>
                </xsd1:localAndOutBoundAuthenticationConfig>
                <xsd:description/>
            </xsd:serviceProvider>
        </xsd:updateApplication>
    </soap:Body>
</soap:Envelope>

